{
    "class_name": "Model",
    "config": {
        "name": "vgg16",
        "layers": [
            {
                "class_name": "Addmm",
                "config": {
                    "bias": "(1000)",
                    "layer_id": "None"
                },
                "name": "classifier.6",
                "inbound_nodes": [
                    [
                        [
                            "2172849142656/Mul0"
                        ],
                        [
                            "classifier.61"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Mul0",
                "config": "None",
                "name": "2172849142656/Mul0",
                "inbound_nodes": [
                    [
                        [
                            "2172849142032/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2172849142032/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "classifier.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Addmm",
                "config": {
                    "bias": "(4096)",
                    "layer_id": "None"
                },
                "name": "classifier.3",
                "inbound_nodes": [
                    [
                        [
                            "2172849141792/Mul0"
                        ],
                        [
                            "classifier.31"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Mul0",
                "config": "None",
                "name": "2172849141792/Mul0",
                "inbound_nodes": [
                    [
                        [
                            "2172849141984/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2172849141984/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "classifier.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Addmm",
                "config": {
                    "bias": "(4096)",
                    "layer_id": "None"
                },
                "name": "classifier.0",
                "inbound_nodes": [
                    [
                        [
                            "2172849143040/View"
                        ],
                        [
                            "classifier.01"
                        ]
                    ]
                ]
            },
            {
                "class_name": "View",
                "config": "None",
                "name": "2172849143040/View",
                "inbound_nodes": [
                    [
                        [
                            "2172849142848/AdaptiveAvgPool2D"
                        ]
                    ]
                ]
            },
            {
                "class_name": "AdaptiveAvgPool2D",
                "config": "None",
                "name": "2172849142848/AdaptiveAvgPool2D",
                "inbound_nodes": [
                    [
                        [
                            "2172849143232/MaxPool2DWithIndices"
                        ]
                    ]
                ]
            },
            {
                "class_name": "MaxPool2DWithIndices",
                "config": "None",
                "name": "2172849143232/MaxPool2DWithIndices",
                "inbound_nodes": [
                    [
                        [
                            "2172849143424/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2172849143424/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "features.34"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(512)",
                    "weight": "(512, 512, 3, 3)",
                    "layer_id": "2172848873632"
                },
                "name": "features.34",
                "inbound_nodes": [
                    [
                        [
                            "2172847461760/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2172847461760/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "features.32"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(512)",
                    "weight": "(512, 512, 3, 3)",
                    "layer_id": "2172848873728"
                },
                "name": "features.32",
                "inbound_nodes": [
                    [
                        [
                            "2172849141600/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2172849141600/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "features.30"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(512)",
                    "weight": "(512, 512, 3, 3)",
                    "layer_id": "2172848873776"
                },
                "name": "features.30",
                "inbound_nodes": [
                    [
                        [
                            "2173012799600/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2173012799600/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "features.28"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(512)",
                    "weight": "(512, 512, 3, 3)",
                    "layer_id": "2172849021616"
                },
                "name": "features.28",
                "inbound_nodes": [
                    [
                        [
                            "2173012799888/MaxPool2DWithIndices"
                        ]
                    ]
                ]
            },
            {
                "class_name": "MaxPool2DWithIndices",
                "config": "None",
                "name": "2173012799888/MaxPool2DWithIndices",
                "inbound_nodes": [
                    [
                        [
                            "2173012800080/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2173012800080/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "features.25"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(512)",
                    "weight": "(512, 512, 3, 3)",
                    "layer_id": "2172849021472"
                },
                "name": "features.25",
                "inbound_nodes": [
                    [
                        [
                            "2173012800272/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2173012800272/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "features.23"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(512)",
                    "weight": "(512, 512, 3, 3)",
                    "layer_id": "2172849021376"
                },
                "name": "features.23",
                "inbound_nodes": [
                    [
                        [
                            "2173012800560/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2173012800560/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "features.21"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(512)",
                    "weight": "(512, 512, 3, 3)",
                    "layer_id": "2172849021280"
                },
                "name": "features.21",
                "inbound_nodes": [
                    [
                        [
                            "2173012800848/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2173012800848/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "features.19"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(512)",
                    "weight": "(512, 256, 3, 3)",
                    "layer_id": "2172849021184"
                },
                "name": "features.19",
                "inbound_nodes": [
                    [
                        [
                            "2173012801136/MaxPool2DWithIndices"
                        ]
                    ]
                ]
            },
            {
                "class_name": "MaxPool2DWithIndices",
                "config": "None",
                "name": "2173012801136/MaxPool2DWithIndices",
                "inbound_nodes": [
                    [
                        [
                            "2173012801328/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2173012801328/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "features.16"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(256)",
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "2172849021040"
                },
                "name": "features.16",
                "inbound_nodes": [
                    [
                        [
                            "2173012801520/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2173012801520/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "features.14"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(256)",
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "2172848876368"
                },
                "name": "features.14",
                "inbound_nodes": [
                    [
                        [
                            "2173012801808/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2173012801808/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "features.12"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(256)",
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "2172848877376"
                },
                "name": "features.12",
                "inbound_nodes": [
                    [
                        [
                            "2173012802096/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2173012802096/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "features.10"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(256)",
                    "weight": "(256, 128, 3, 3)",
                    "layer_id": "2172848875216"
                },
                "name": "features.10",
                "inbound_nodes": [
                    [
                        [
                            "2173012802384/MaxPool2DWithIndices"
                        ]
                    ]
                ]
            },
            {
                "class_name": "MaxPool2DWithIndices",
                "config": "None",
                "name": "2173012802384/MaxPool2DWithIndices",
                "inbound_nodes": [
                    [
                        [
                            "2173012802576/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2173012802576/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "features.7"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(128)",
                    "weight": "(128, 128, 3, 3)",
                    "layer_id": "2172532724640"
                },
                "name": "features.7",
                "inbound_nodes": [
                    [
                        [
                            "2173012802816/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2173012802816/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "features.5"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(128)",
                    "weight": "(128, 64, 3, 3)",
                    "layer_id": "2172844251216"
                },
                "name": "features.5",
                "inbound_nodes": [
                    [
                        [
                            "2173012803152/MaxPool2DWithIndices"
                        ]
                    ]
                ]
            },
            {
                "class_name": "MaxPool2DWithIndices",
                "config": "None",
                "name": "2173012803152/MaxPool2DWithIndices",
                "inbound_nodes": [
                    [
                        [
                            "2173012803344/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2173012803344/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "features.2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(64)",
                    "weight": "(64, 64, 3, 3)",
                    "layer_id": "2172780870336"
                },
                "name": "features.2",
                "inbound_nodes": [
                    [
                        [
                            "2173012828272/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2173012828272/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "features.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(64)",
                    "weight": "(64, 3, 3, 3)",
                    "layer_id": "2172531668352"
                },
                "name": "features.0",
                "inbound_nodes": []
            },
            {
                "class_name": "T",
                "config": {
                    "weight": "(4096, 25088)",
                    "layer_id": "2172847462384"
                },
                "name": "classifier.01",
                "inbound_nodes": []
            },
            {
                "class_name": "T",
                "config": {
                    "weight": "(4096, 4096)",
                    "layer_id": "2172847462000"
                },
                "name": "classifier.31",
                "inbound_nodes": []
            },
            {
                "class_name": "T",
                "config": {
                    "weight": "(1000, 4096)",
                    "layer_id": "2172847462144"
                },
                "name": "classifier.61",
                "inbound_nodes": []
            }
        ]
    }
}