{
    "class_name": "Model",
    "config": {
        "name": "vgg16",
        "layers": [
            {
                "class_name": "Addmm",
                "config": {
                    "bias": "(1000)",
                    "layer_id": "None"
                },
                "name": "fc",
                "inbound_nodes": [
                    [
                        [
                            "2846364658080/View"
                        ],
                        [
                            "fc1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "View",
                "config": "None",
                "name": "2846364658080/View",
                "inbound_nodes": [
                    [
                        [
                            "2846364658368/View"
                        ]
                    ]
                ]
            },
            {
                "class_name": "View",
                "config": "None",
                "name": "2846364658368/View",
                "inbound_nodes": [
                    [
                        [
                            "2846364659136/Mean1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Mean1",
                "config": "None",
                "name": "2846364659136/Mean1",
                "inbound_nodes": [
                    [
                        [
                            "2846364659184/View"
                        ]
                    ]
                ]
            },
            {
                "class_name": "View",
                "config": "None",
                "name": "2846364659184/View",
                "inbound_nodes": [
                    [
                        [
                            "2846364659280/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2846364659280/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "2846364659424/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "2846364659424/Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer4.1.bn2"
                        ],
                        [
                            "2846364659616/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(512)",
                    "weight": "(512)",
                    "layer_id": "2846332109872"
                },
                "name": "layer4.1.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer4.1.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(512, 512, 3, 3)",
                    "layer_id": "2846332109824"
                },
                "name": "layer4.1.conv2",
                "inbound_nodes": [
                    [
                        [
                            "2846364737600/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2846364737600/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.1.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(512)",
                    "weight": "(512)",
                    "layer_id": "2846332109728"
                },
                "name": "layer4.1.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.1.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(512, 512, 3, 3)",
                    "layer_id": "2846332109680"
                },
                "name": "layer4.1.conv1",
                "inbound_nodes": [
                    [
                        [
                            "2846364659616/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2846364659616/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "2846364738176/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "2846364738176/Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer4.0.bn2"
                        ],
                        [
                            "layer4.0.downsample.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(512)",
                    "weight": "(512)",
                    "layer_id": "2846332109584"
                },
                "name": "layer4.0.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer4.0.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(512, 512, 3, 3)",
                    "layer_id": "2846332109536"
                },
                "name": "layer4.0.conv2",
                "inbound_nodes": [
                    [
                        [
                            "2846364738656/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2846364738656/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.0.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(512)",
                    "weight": "(512)",
                    "layer_id": "2846332109440"
                },
                "name": "layer4.0.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.0.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(512, 256, 3, 3)",
                    "layer_id": "2846332109392"
                },
                "name": "layer4.0.conv1",
                "inbound_nodes": [
                    [
                        [
                            "2846364739136/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2846364739136/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "2846364739280/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "2846364739280/Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer3.1.bn2"
                        ],
                        [
                            "2846364739472/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(256)",
                    "weight": "(256)",
                    "layer_id": "2846330529008"
                },
                "name": "layer3.1.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer3.1.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "2846330529536"
                },
                "name": "layer3.1.conv2",
                "inbound_nodes": [
                    [
                        [
                            "2846364739760/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2846364739760/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.1.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(256)",
                    "weight": "(256)",
                    "layer_id": "2846330529440"
                },
                "name": "layer3.1.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.1.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "2846330529392"
                },
                "name": "layer3.1.conv1",
                "inbound_nodes": [
                    [
                        [
                            "2846364739472/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2846364739472/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "2846364740336/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "2846364740336/Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer3.0.bn2"
                        ],
                        [
                            "layer3.0.downsample.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(256)",
                    "weight": "(256)",
                    "layer_id": "2846330529296"
                },
                "name": "layer3.0.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer3.0.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "2846330529248"
                },
                "name": "layer3.0.conv2",
                "inbound_nodes": [
                    [
                        [
                            "2846364740816/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2846364740816/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.0.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(256)",
                    "weight": "(256)",
                    "layer_id": "2846330529584"
                },
                "name": "layer3.0.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.0.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(256, 128, 3, 3)",
                    "layer_id": "2846330529632"
                },
                "name": "layer3.0.conv1",
                "inbound_nodes": [
                    [
                        [
                            "2846364741296/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2846364741296/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "2846364741440/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "2846364741440/Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer2.1.bn2"
                        ],
                        [
                            "2846364766272/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(128)",
                    "weight": "(128)",
                    "layer_id": "2846331879232"
                },
                "name": "layer2.1.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer2.1.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(128, 128, 3, 3)",
                    "layer_id": "2846331945072"
                },
                "name": "layer2.1.conv2",
                "inbound_nodes": [
                    [
                        [
                            "2846364766560/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2846364766560/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer2.1.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(128)",
                    "weight": "(128)",
                    "layer_id": "2846331945120"
                },
                "name": "layer2.1.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer2.1.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(128, 128, 3, 3)",
                    "layer_id": "2846331945216"
                },
                "name": "layer2.1.conv1",
                "inbound_nodes": [
                    [
                        [
                            "2846364766272/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2846364766272/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "2846364767136/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "2846364767136/Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer2.0.bn2"
                        ],
                        [
                            "layer2.0.downsample.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(128)",
                    "weight": "(128)",
                    "layer_id": "2846332109200"
                },
                "name": "layer2.0.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer2.0.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(128, 128, 3, 3)",
                    "layer_id": "2846332109152"
                },
                "name": "layer2.0.conv2",
                "inbound_nodes": [
                    [
                        [
                            "2846364767616/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2846364767616/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer2.0.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(128)",
                    "weight": "(128)",
                    "layer_id": "2846332109056"
                },
                "name": "layer2.0.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer2.0.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(128, 64, 3, 3)",
                    "layer_id": "2846332109008"
                },
                "name": "layer2.0.conv1",
                "inbound_nodes": [
                    [
                        [
                            "2846364768096/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2846364768096/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "2846364768240/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "2846364768240/Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer1.1.bn2"
                        ],
                        [
                            "2846364768432/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(64)",
                    "weight": "(64)",
                    "layer_id": "2846331948288"
                },
                "name": "layer1.1.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer1.1.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(64, 64, 3, 3)",
                    "layer_id": "2846331946752"
                },
                "name": "layer1.1.conv2",
                "inbound_nodes": [
                    [
                        [
                            "2846364768720/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2846364768720/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer1.1.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(64)",
                    "weight": "(64)",
                    "layer_id": "2846331947904"
                },
                "name": "layer1.1.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer1.1.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(64, 64, 3, 3)",
                    "layer_id": "2846331948720"
                },
                "name": "layer1.1.conv1",
                "inbound_nodes": [
                    [
                        [
                            "2846364768432/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2846364768432/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "2846364769296/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "2846364769296/Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer1.0.bn2"
                        ],
                        [
                            "2846364769488/MaxPool2DWithIndices"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(64)",
                    "weight": "(64)",
                    "layer_id": "2846327318992"
                },
                "name": "layer1.0.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer1.0.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(64, 64, 3, 3)",
                    "layer_id": "2846327318848"
                },
                "name": "layer1.0.conv2",
                "inbound_nodes": [
                    [
                        [
                            "2846364769776/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2846364769776/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer1.0.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(64)",
                    "weight": "(64)",
                    "layer_id": "2846327318512"
                },
                "name": "layer1.0.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer1.0.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(64, 64, 3, 3)",
                    "layer_id": "2846327318560"
                },
                "name": "layer1.0.conv1",
                "inbound_nodes": [
                    [
                        [
                            "2846364769488/MaxPool2DWithIndices"
                        ]
                    ]
                ]
            },
            {
                "class_name": "MaxPool2DWithIndices",
                "config": "None",
                "name": "2846364769488/MaxPool2DWithIndices",
                "inbound_nodes": [
                    [
                        [
                            "2846364782704/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2846364782704/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(64)",
                    "weight": "(64)",
                    "layer_id": "2846014861616"
                },
                "name": "bn1",
                "inbound_nodes": [
                    [
                        [
                            "conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(64, 3, 7, 7)",
                    "layer_id": "2846014863392"
                },
                "name": "conv1",
                "inbound_nodes": []
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(128)",
                    "weight": "(128)",
                    "layer_id": "2846332108864"
                },
                "name": "layer2.0.downsample.1",
                "inbound_nodes": [
                    [
                        [
                            "layer2.0.downsample.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(128, 64, 1, 1)",
                    "layer_id": "2846331948144"
                },
                "name": "layer2.0.downsample.0",
                "inbound_nodes": [
                    [
                        [
                            "2846364768096/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(256)",
                    "weight": "(256)",
                    "layer_id": "2846330529776"
                },
                "name": "layer3.0.downsample.1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.0.downsample.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(256, 128, 1, 1)",
                    "layer_id": "2846330529824"
                },
                "name": "layer3.0.downsample.0",
                "inbound_nodes": [
                    [
                        [
                            "2846364741296/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(512)",
                    "weight": "(512)",
                    "layer_id": "2846330528768"
                },
                "name": "layer4.0.downsample.1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.0.downsample.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(512, 256, 1, 1)",
                    "layer_id": "2846330528816"
                },
                "name": "layer4.0.downsample.0",
                "inbound_nodes": [
                    [
                        [
                            "2846364739136/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "T",
                "config": {
                    "weight": "(1000, 512)",
                    "layer_id": "2846332110016"
                },
                "name": "fc1",
                "inbound_nodes": []
            }
        ]
    }
}