{
    "class_name": "Model",
    "config": {
        "name": "vgg16",
        "layers": [
            {
                "class_name": "Addmm",
                "config": {
                    "bias": "(1000)",
                    "layer_id": "None"
                },
                "name": "fc",
                "inbound_nodes": [
                    [
                        [
                            "2049412257632/View"
                        ],
                        [
                            "fc1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "View",
                "config": "None",
                "name": "2049412257632/View",
                "inbound_nodes": [
                    [
                        [
                            "2049412257776/View"
                        ]
                    ]
                ]
            },
            {
                "class_name": "View",
                "config": "None",
                "name": "2049412257776/View",
                "inbound_nodes": [
                    [
                        [
                            "2049412257872/Mean1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Mean1",
                "config": "None",
                "name": "2049412257872/Mean1",
                "inbound_nodes": [
                    [
                        [
                            "2049412257968/View"
                        ]
                    ]
                ]
            },
            {
                "class_name": "View",
                "config": "None",
                "name": "2049412257968/View",
                "inbound_nodes": [
                    [
                        [
                            "2049412258112/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2049412258112/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "2049412258688/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "2049412258688/Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer4.1.bn2"
                        ],
                        [
                            "2049412259600/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(512)",
                    "weight": "(512)",
                    "layer_id": "2049411610944"
                },
                "name": "layer4.1.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer4.1.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(512, 512, 3, 3)",
                    "layer_id": "2049381432864"
                },
                "name": "layer4.1.conv2",
                "inbound_nodes": [
                    [
                        [
                            "2049412259696/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2049412259696/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.1.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(512)",
                    "weight": "(512)",
                    "layer_id": "2049500023008"
                },
                "name": "layer4.1.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.1.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(512, 512, 3, 3)",
                    "layer_id": "2049500022960"
                },
                "name": "layer4.1.conv1",
                "inbound_nodes": [
                    [
                        [
                            "2049412259600/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2049412259600/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "2049499702032/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "2049499702032/Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer4.0.bn2"
                        ],
                        [
                            "layer4.0.downsample.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(512)",
                    "weight": "(512)",
                    "layer_id": "2049500022864"
                },
                "name": "layer4.0.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer4.0.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(512, 512, 3, 3)",
                    "layer_id": "2049500022816"
                },
                "name": "layer4.0.conv2",
                "inbound_nodes": [
                    [
                        [
                            "2049500113936/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2049500113936/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.0.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(512)",
                    "weight": "(512)",
                    "layer_id": "2049500022720"
                },
                "name": "layer4.0.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.0.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(512, 256, 3, 3)",
                    "layer_id": "2049500022672"
                },
                "name": "layer4.0.conv1",
                "inbound_nodes": [
                    [
                        [
                            "2049381417072/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2049381417072/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "2049381417216/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "2049381417216/Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer3.1.bn2"
                        ],
                        [
                            "2049381417360/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(256)",
                    "weight": "(256)",
                    "layer_id": "2049500022384"
                },
                "name": "layer3.1.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer3.1.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "2049500022336"
                },
                "name": "layer3.1.conv2",
                "inbound_nodes": [
                    [
                        [
                            "2049381417648/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2049381417648/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.1.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(256)",
                    "weight": "(256)",
                    "layer_id": "2049500022240"
                },
                "name": "layer3.1.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.1.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "2049500022192"
                },
                "name": "layer3.1.conv1",
                "inbound_nodes": [
                    [
                        [
                            "2049381417360/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2049381417360/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "2049381418176/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "2049381418176/Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer3.0.bn2"
                        ],
                        [
                            "layer3.0.downsample.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(256)",
                    "weight": "(256)",
                    "layer_id": "2049500022096"
                },
                "name": "layer3.0.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer3.0.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "2049500022048"
                },
                "name": "layer3.0.conv2",
                "inbound_nodes": [
                    [
                        [
                            "2049381418608/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2049381418608/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.0.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(256)",
                    "weight": "(256)",
                    "layer_id": "2049500021952"
                },
                "name": "layer3.0.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.0.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(256, 128, 3, 3)",
                    "layer_id": "2049500021904"
                },
                "name": "layer3.0.conv1",
                "inbound_nodes": [
                    [
                        [
                            "2049381419040/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2049381419040/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "2049381419184/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "2049381419184/Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer2.1.bn2"
                        ],
                        [
                            "2049381419328/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(128)",
                    "weight": "(128)",
                    "layer_id": "2049500021616"
                },
                "name": "layer2.1.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer2.1.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(128, 128, 3, 3)",
                    "layer_id": "2049500021568"
                },
                "name": "layer2.1.conv2",
                "inbound_nodes": [
                    [
                        [
                            "2049381419616/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2049381419616/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer2.1.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(128)",
                    "weight": "(128)",
                    "layer_id": "2049500021472"
                },
                "name": "layer2.1.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer2.1.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(128, 128, 3, 3)",
                    "layer_id": "2049500021424"
                },
                "name": "layer2.1.conv1",
                "inbound_nodes": [
                    [
                        [
                            "2049381419328/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2049381419328/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "2049381420144/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "2049381420144/Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer2.0.bn2"
                        ],
                        [
                            "layer2.0.downsample.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(128)",
                    "weight": "(128)",
                    "layer_id": "2049500020944"
                },
                "name": "layer2.0.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer2.0.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(128, 128, 3, 3)",
                    "layer_id": "2049500021088"
                },
                "name": "layer2.0.conv2",
                "inbound_nodes": [
                    [
                        [
                            "2049381420576/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2049381420576/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer2.0.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(128)",
                    "weight": "(128)",
                    "layer_id": "2049500020800"
                },
                "name": "layer2.0.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer2.0.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(128, 64, 3, 3)",
                    "layer_id": "2049500021376"
                },
                "name": "layer2.0.conv1",
                "inbound_nodes": [
                    [
                        [
                            "2049381421008/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2049381421008/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "2049500242080/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "2049500242080/Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer1.1.bn2"
                        ],
                        [
                            "2049500242224/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(64)",
                    "weight": "(64)",
                    "layer_id": "2049499705104"
                },
                "name": "layer1.1.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer1.1.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(64, 64, 3, 3)",
                    "layer_id": "2049499702368"
                },
                "name": "layer1.1.conv2",
                "inbound_nodes": [
                    [
                        [
                            "2049500242512/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2049500242512/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer1.1.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(64)",
                    "weight": "(64)",
                    "layer_id": "2049499705296"
                },
                "name": "layer1.1.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer1.1.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(64, 64, 3, 3)",
                    "layer_id": "2049499704768"
                },
                "name": "layer1.1.conv1",
                "inbound_nodes": [
                    [
                        [
                            "2049500242224/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2049500242224/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "2049500243040/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "2049500243040/Add0",
                "inbound_nodes": [
                    [
                        [
                            "layer1.0.bn2"
                        ],
                        [
                            "2049500243184/MaxPool2DWithIndices"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(64)",
                    "weight": "(64)",
                    "layer_id": "2049499705008"
                },
                "name": "layer1.0.bn2",
                "inbound_nodes": [
                    [
                        [
                            "layer1.0.conv2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(64, 64, 3, 3)",
                    "layer_id": "2049499704672"
                },
                "name": "layer1.0.conv2",
                "inbound_nodes": [
                    [
                        [
                            "2049500243472/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2049500243472/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "layer1.0.bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(64)",
                    "weight": "(64)",
                    "layer_id": "2049499704624"
                },
                "name": "layer1.0.bn1",
                "inbound_nodes": [
                    [
                        [
                            "layer1.0.conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(64, 64, 3, 3)",
                    "layer_id": "2049412258256"
                },
                "name": "layer1.0.conv1",
                "inbound_nodes": [
                    [
                        [
                            "2049500243184/MaxPool2DWithIndices"
                        ]
                    ]
                ]
            },
            {
                "class_name": "MaxPool2DWithIndices",
                "config": "None",
                "name": "2049500243184/MaxPool2DWithIndices",
                "inbound_nodes": [
                    [
                        [
                            "2049500244000/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "2049500244000/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "bn1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(64)",
                    "weight": "(64)",
                    "layer_id": "2049412259792"
                },
                "name": "bn1",
                "inbound_nodes": [
                    [
                        [
                            "conv1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(64, 3, 7, 7)",
                    "layer_id": "2049412259024"
                },
                "name": "conv1",
                "inbound_nodes": []
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(128)",
                    "weight": "(128)",
                    "layer_id": "2049499704864"
                },
                "name": "layer2.0.downsample.1",
                "inbound_nodes": [
                    [
                        [
                            "layer2.0.downsample.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(128, 64, 1, 1)",
                    "layer_id": "2049499704960"
                },
                "name": "layer2.0.downsample.0",
                "inbound_nodes": [
                    [
                        [
                            "2049381421008/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(256)",
                    "weight": "(256)",
                    "layer_id": "2049500021760"
                },
                "name": "layer3.0.downsample.1",
                "inbound_nodes": [
                    [
                        [
                            "layer3.0.downsample.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(256, 128, 1, 1)",
                    "layer_id": "2049500021712"
                },
                "name": "layer3.0.downsample.0",
                "inbound_nodes": [
                    [
                        [
                            "2049381419040/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "NativeBatchNorm",
                "config": {
                    "bias": "(512)",
                    "weight": "(512)",
                    "layer_id": "2049500022528"
                },
                "name": "layer4.0.downsample.1",
                "inbound_nodes": [
                    [
                        [
                            "layer4.0.downsample.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(512, 256, 1, 1)",
                    "layer_id": "2049500022480"
                },
                "name": "layer4.0.downsample.0",
                "inbound_nodes": [
                    [
                        [
                            "2049381417072/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "T",
                "config": {
                    "weight": "(1000, 512)",
                    "layer_id": "2049411487728"
                },
                "name": "fc1",
                "inbound_nodes": []
            }
        ]
    }
}